Core/src/Documents/ПеремещениеЗапасов/ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеЗапасов</name>
  <basedOn>Document.ПеремещениеПоЯчейкам</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.СборкаЗапасов</basedOn>
  <basedOn>Document.ПриходныйОрдер</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <basedOn>Document.ПеремещениеЗапасов</basedOn>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПеремещение</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыВРазрезеГТД</registerRecords>
  <registerRecords>AccumulationRegister.СуммовойУчетВРознице</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКРасходуСоСкладов</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКПоступлениюНаСклады</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.СерийныеНомера</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПринятые</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПеревозчика</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьВыдана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.СборкаЗапасов</types>
      <types>DocumentRef.ПеремещениеПоЯчейкам</types>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
      <types>DocumentRef.ПриходныйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПечатиСсылка</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщикаОтправил</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщикаПолучил</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКонтролера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЗаказаПокупателя</name>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтпустил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтпустилДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРуководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРуководительДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПеремещенияИзТранзита</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПеремещения</name>
    <type>
      <types>EnumRef.СтатусПеремещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПеремещенияВТранзит</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаКонечныйПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDНД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЯчейкиВПеремещенииЗапасов</name>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВДороге</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ВключаяХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтруктурныхЕдиниц</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПеремещениеЗапасов/ObjectModule.bsl
//Паганини_
Перем мРежимЗаписи;
Перем мИспользоватьСтатусыВДокументеЗаказНаВнутреннееПеремещение;
Перем ИспользоватьТолькоРегламентированногоПланаСчетов Экспорт; //+++ Дмгг
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПодписиКладовщиков()
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		
		ПодписьКладовщикаОтправил = СтруктурнаяЕдиница.ПодписьМОЛ;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиницаПолучатель) Тогда
		
		ПодписьКладовщикаПолучил = СтруктурнаяЕдиницаПолучатель.ПодписьМОЛ;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет наличие розничной цены.
//
Процедура ПроверитьНаличиеРозничнойЦены(Отказ)
	
	Если СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы <> Перечисления.ТипыСтруктурныхЕдиниц.Розница И
		СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы <> Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТаблицаДокумента", Запасы);
	Запрос.УстановитьПараметр("РозничныйВидЦен", СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен);
	Запрос.УстановитьПараметр("СписокНоменклатура", Запасы.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СписокХарактеристика", Запасы.ВыгрузитьКолонку("Характеристика"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Партия КАК Партия
	|ПОМЕСТИТЬ ПеремещениеЗапасовЗапасы
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещениеЗапасовЗапасы.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещениеЗапасовЗапасы.Характеристика) КАК ХарактеристикаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещениеЗапасовЗапасы.Партия) КАК ПартияПредставление
	|ИЗ
	|	ПеремещениеЗапасовЗапасы КАК ПеремещениеЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ВидЦен = &РозничныйВидЦен
	|					И Номенклатура В (&СписокНоменклатура)
	|					И Характеристика В (&СписокХарактеристика)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеЗапасовЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ПеремещениеЗапасовЗапасы.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|ГДЕ
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		
		ТекстСообщения = НСтр("ka='სია ""მარაგების"" სტრიქონ %НомерСтроки%-ში ნომენკლატურა %ПредставлениеНоменклатуры%-სთვის საცალო ფასი არ არის დაყენებული!';ru='Для номенклатуры %ПредставлениеНоменклатуры% в строке %НомерСтроки% списка ""Запасы"" не установлена розничная цена!';en='For nomenclature PredstavlenieNomenklatury%% Row% NomerStroki% list ""Inventories"" does not set the retail price!'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(ВыборкаРезультатаЗапроса.НомерСтроки));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеНоменклатуры%",  УправлениеНебольшойФирмойСервер.ПредставлениеНоменклатуры(ВыборкаРезультатаЗапроса.НоменклатураПредставление, ВыборкаРезультатаЗапроса.ХарактеристикаПредставление, ВыборкаРезультатаЗапроса.ПартияПредставление));
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
		ЭтотОбъект,
		ТекстСообщения,
		"Запасы",
		ВыборкаРезультатаЗапроса.НомерСтроки,
		"Номенклатура",
		Отказ
		);
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНаличиеРозничнойЦены()

#КонецОбласти

#Область ПроцедурыЗаполненияДокумента

// Процедура заполняет табличную часть Запасы по остаткам на складе.
//
Процедура ЗаполнитьЗапасыПоОстаткамНаСкладе() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыНаСкладахОстатки.Организация КАК Организация,
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладахОстатки.Партия КАК Партия,
	|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыНаСкладах.Организация КАК Организация,
	|		ЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|		ЗапасыНаСкладах.Характеристика КАК Характеристика,
	|		ЗапасыНаСкладах.Партия КАК Партия,
	|		ЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыНаСкладах.Ячейка КАК Ячейка,
	|		ЗапасыНаСкладах.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				Организация = &Организация
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					И Ячейка = &Ячейка) КАК ЗапасыНаСкладах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасыНаСкладах.Организация,
	|		ДвиженияДокументаЗапасыНаСкладах.Номенклатура,
	|		ДвиженияДокументаЗапасыНаСкладах.Характеристика,
	|		ДвиженияДокументаЗапасыНаСкладах.Партия,
	|		ДвиженияДокументаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасыНаСкладах.Ячейка,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасыНаСкладах.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасыНаСкладах.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЗапасыНаСкладах КАК ДвиженияДокументаЗапасыНаСкладах
	|	ГДЕ
	|		ДвиженияДокументаЗапасыНаСкладах.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасыНаСкладах.Период <= &Период
	|		И ДвиженияДокументаЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ЗапасыНаСкладахОстатки
	|ГДЕ
	|	ЗапасыНаСкладахОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладахОстатки.Организация,
	|	ЗапасыНаСкладахОстатки.Номенклатура,
	|	ЗапасыНаСкладахОстатки.Характеристика,
	|	ЗапасыНаСкладахОстатки.Партия,
	|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница,
	|	ЗапасыНаСкладахОстатки.Ячейка,
	|	ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьЗапасыПоОстаткамНаСкладе()

// Процедура заполняет клонку Количество по резервам под заказ.
//
Процедура ЗаполнитьКолонкуРезервПоРезервам() Экспорт
	
	Запасы.ЗагрузитьКолонку(Новый Массив(Запасы.Количество()), "Резерв");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА &ЗаказВШапке
	|			ТОГДА &Заказ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаЗапасы.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	|						И ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					ТОГДА ТаблицаЗапасы.ЗаказПокупателя
	|				ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы";
	
	ЗаказВШапке = ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Запасы.Выгрузить());
	Запрос.УстановитьПараметр("ЗаказВШапке", ЗаказВШапке);
	Запрос.УстановитьПараметр("Заказ", ?(ЗначениеЗаполнено(ЗаказПокупателя), ЗаказПокупателя, Документы.ЗаказПокупателя.ПустаяСсылка()));
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						&Организация,
	|						&СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &Период
	|		И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ДвиженияДокументаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		Если НЕ ЗаказВШапке Тогда
			СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.ЗаказПокупателя);
		КонецЕсли;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		МассивСтрокЗапасы = Запасы.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток / СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			Если СтрокаЗапасы.Количество >= ВсегоОстаток Тогда
				СтрокаЗапасы.Резерв = ВсегоОстаток;
				ВсегоОстаток = 0;
			Иначе
				СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
				ВсегоОстаток = ВсегоОстаток - СтрокаЗапасы.Количество;
				ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток * СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКолонкуРезервПоРезервам()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		
		Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
			
			СтрокаТабличнойЧасти.ЗаказПокупателя = ЗаказПокупателя;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Если СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы
			И (ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию)
			И НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
			
			НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
		//+++ Дмгг		
		ИначеЕсли СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы
			И (ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию) 
			И ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
			
			НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
		//--- Дмгг	
		КонецЕсли;	
		
	КонецЕсли;	
	//Паганини_
	мИспользоватьСтатусыВДокументеЗаказНаВнутреннееПеремещение = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		ЧерезТранзитныйСклад 		= Ложь;
		ДатаПеремещенияИзТранзита 	= Дата(1,1,1);
		СтатусПеремещения			= Неопределено;
		Для Каждого СтрокаТЧ ИЗ Запасы Цикл
			СтрокаТЧ.КоличествоВДороге = 0;
		КонецЦикла;
	Иначе
		Если НЕ ЧерезТранзитныйСклад Тогда
			ДатаПеремещенияИзТранзита 	= Дата(1,1,1);
			СтатусПеремещения			= Неопределено;
			Для Каждого СтрокаТЧ ИЗ Запасы Цикл
				СтрокаТЧ.КоличествоВДороге = 0;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	мРежимЗаписи = РежимЗаписи;
	Если мИспользоватьСтатусыВДокументеЗаказНаВнутреннееПеремещение И 
		 НЕ ЗначениеЗаполнено(ДокументПеремещенияВТранзит) Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			пКоличествоВсего 		= Запасы.Итог("Количество");
			пКоличествоВДорогеВсего = Запасы.Итог("КоличествоВДороге");
			Если пКоличествоВДорогеВсего = 0 Тогда
				СтатусПеремещения = Перечисления.СтатусПеремещения.Завершенный;
			Иначе
				Если пКоличествоВсего = пКоличествоВДорогеВсего Тогда
					СтатусПеремещения = Перечисления.СтатусПеремещения.ВРаботе;
				Иначе
					СтатусПеремещения = Перечисления.СтатусПеремещения.ЧастичноПолученный;
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтатусПеремещения = Неопределено;
		КонецЕсли;
	КонецЕсли;
	//_Паганини
	
	//DD
	Если мИспользоватьСтатусыВДокументеЗаказНаВнутреннееПеремещение И 
		НЕ ЗначениеЗаполнено(ДокументПеремещенияВТранзит) И Не ЗначениеЗаполнено(ДатаПеремещенияИзТранзита) Тогда
		ДатаПеремещенияИзТранзита = Дата + 1;
	КонецЕсли;	 		
		
		
		
КонецПроцедуры // ПередЗаписью()

// В обработчике события ОбработкаЗаполнения документа выполняется
// - заполнение документа по инвентаризации товаров в месте хранения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеПоЯчейкам")] = "ЗаполнитьПоПеремещениюПоЯчейкам";
	СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкеЗапасов";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказНаПроизводство")] = "ЗаполнитьПоЗаказуНаПроизводство";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнойНакладной";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
	//Паганини_
	СтратегияЗаполнения[Тип("ДокументСсылка.ВнутреннийЗаказ")] = "ЗаполнитьПоВнутреннийЗаказ";
	//_Паганини
	
	//ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения, "ЗаказПокупателя");
	// Kuzmich, 08.01.2020
	ИсключаяСвойства = "ЗаказПокупателя";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";// Kuzmich, 08.01.2020
	Если ТипЗНЧ(ДанныеЗаполнения)=Тип("ДокументСсылка.ПеремещениеЗапасов")
		ИЛИ ТипЗНЧ(ДанныеЗаполнения)=Тип("ДокументОбъект.ПеремещениеЗапасов")
		Тогда
		
		ТекМетаданные = ДанныеЗаполнения.Метаданные();
		Для каждого ТекРеквизит Из ТекМетаданные.Реквизиты Цикл
			ИсключаяСвойства = ИсключаяСвойства + "," + ТекРеквизит.Имя;
		КонецЦикла;
			
	КонецЕсли;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения, ИсключаяСвойства);
	// Kuzmich, 08.01.2020
	
	ЗаполнитьПодписиКладовщиков();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка наличия розничной цены.
	ПроверитьНаличиеРозничнойЦены(Отказ);
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	
	Если Запасы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если (ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию
	 ИЛИ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) 
	 И НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
		ПроверяемыеРеквизиты.Добавить("СчетЗатрат");
	КонецЕсли;
	
	//+++ Дмгг
	Если (ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию
	 ИЛИ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) 
	 И ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
		ПроверяемыеРеквизиты.Добавить("СчетЗатратРегл");
	КонецЕсли;
	//--- Дмгг
	
	Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
		
		Для каждого СтрокаЗапасы Из Запасы Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаЗапасы.ЗаказПокупателя) И СтрокаЗапасы.Резерв > 0 Тогда
				
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, 
				"В строке указано количество резерва, но не указан заказ.",
				"Запасы",
				СтрокаЗапасы.НомерСтроки,
				"Резерв",
				Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		
		Для каждого СтрокаЗапасы Из Запасы Цикл
			
			Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) И СтрокаЗапасы.Резерв > 0 Тогда
				
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, 
				"В строке указано количество резерва, но не указан заказ.",
				"Запасы",
				СтрокаЗапасы.НомерСтроки,
				"Резерв",
				Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() 
		И (ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) Тогда
		
		Для каждого СтрокаЗапасы Из Запасы Цикл
			
			Если СтрокаЗапасы.Резерв > СтрокаЗапасы.Количество Тогда
				
				ТекстСообщения = НСтр("ka='ცხრილ ""მარაგების"" სტრიქონ №%Номер% რეზერვში გადაცემული პოზიციების რაოდენობა აღემატება მარაგების საერთო რაოდენობას.';ru='В строке №%Номер% табл. части ""Запасы"" количество передаваемых в резерв позиций превышает общее количество запасов.';en='In line №% number% Table. part of the ""reserve"" amount transferred to the reserve position is greater than the total number of stocks.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаЗапасы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Запасы",
					СтрокаЗапасы.НомерСтроки,
					"Резерв",
					Отказ
				);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Серийные номера
	Если НЕ (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиница,"ОрдерныйСклад") = Истина 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиницаПолучатель,"ОрдерныйСклад") = Истина) Тогда
		РаботаССерийнымиНомерами.ПроверкаЗаполненияСерийныхНомеров(Отказ, Запасы, СерийныеНомера, СтруктурнаяЕдиница, ЭтотОбъект);
	КонецЕсли;
	
	Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") 
		И НЕ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС Тогда
		Если Не ЗначениеЗаполнено(СтруктурнаяЕдиницаКонечныйПолучатель) Тогда		
			ТекстСообщения = НСтр("ka='არ არის შევსებული საბოლოო მიმღები.';ru='Не заполнен Конечный получатель';en='The final recipient is empty'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			"СтруктурнаяЕдиницаКонечныйПолучатель",
			Отказ
			);
		КонецЕсли;
	КонецЕсли;		
	
	
	//+++ Дмгг
	Если ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиницаПолучатель");
		
	ИначеЕсли НЕ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.ВнеоборотныйАктив");
	КонецЕсли;

	
	Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатрат");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПеремещениеЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыКРасходуСоСкладов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыКПоступлениюНаСклады(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыВРазрезеГТД(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСуммовойУчетВРознице(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераОстатки(ДополнительныеСвойства, Движения, Отказ);
	//Паганини_
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьЗаказНаПеремещение(ДополнительныеСвойства, Движения, Отказ);
	//_Паганини
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.ПеремещениеЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	Если НЕ Отказ Тогда 
		Документы.ПеремещениеЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ,,Истина);
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	Если Не Отказ Тогда 
		
		Если Константы.ФункционалСбораТоваров.Получить() Тогда  
			Для Каждого Стр Из Запасы Цикл 
				Если ЗначениеЗаполнено(Стр.ЗаказПокупателя) Тогда
					ДокОб = Стр.ЗаказПокупателя.ПолучитьОбъект();
					Если ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Собран Тогда
						ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт;
						ДокОб.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		//Паганини_
		//СоздатьИлиИзменитьДокументПеремещения(Отказ);
		//_Паганини
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.ПеремещениеЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);   
	
	Если Не Отказ Тогда 
		Если Константы.ФункционалСбораТоваров.Получить() Тогда 
			Для Каждого Стр Из Запасы Цикл 
				Если ЗначениеЗаполнено(Стр.ЗаказПокупателя) Тогда
					ДокОб = Стр.ЗаказПокупателя.ПолучитьОбъект();
					Если ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт Тогда
						ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Собран;
						ДокОб.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Паганини_
		//СоздатьИлиИзменитьДокументПеремещения(Отказ);
		//_Паганини
	КонецЕсли;

	
КонецПроцедуры

// Обработчик заполнения на основании документа ПриходнаяНакладная.
//
// Параметры:
//	ДокументСсылкаПриходнаяНакладная - ДокументСсылка.ПриходнаяНакладная.
//	
Процедура ЗаполнитьПоПриходнойНакладной(ДокументСсылкаПриходнаяНакладная) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПриходнаяНакладная);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	// Заполним данные шапки документа.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Ссылка КАК ДокументОснование,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Номер КАК НомерВходящегоДокумента,
	|	ТаблицаДокумента.Дата КАК ДатаВходящегоДокумента,
	|	ТаблицаДокумента.ВалютаДокумента КАК ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Ячейка,
	|	ТаблицаДокумента.Запасы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		Партия,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		Заказ,
	|		Всего,
	|		Себестоимость,
	|		СуммаРасходов,
	|		Содержание,
	|		СерийныеНомера,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Запасы.Загрузить(Выборка.Запасы.Выгрузить());
	
	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДокументСсылкаПриходнаяНакладная);
	
КонецПроцедуры // ЗаполнитьПоПриходнаяНакладная()

Процедура ЗаполнитьПоПриходномуОрдеру(ДанныеЗаполнения) Экспорт
	
	Организация = ДанныеЗаполнения.Организация;
	ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	СтруктурнаяЕдиницаПолучатель = ДанныеЗаполнения.СтруктурнаяЕдиница;
	ЯчейкаПолучатель = ДанныеЗаполнения.Ячейка;
	
	Запасы.Очистить();
	Для каждого ТекСтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗапасы);
	КонецЦикла;

	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения) Экспорт
	
	ДанныеЗаполненияВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВидОперации");
	
	Если ДанныеЗаполненияВидОперации = Перечисления.ВидыОперацийЗаказНаПроизводство.Сборка Тогда
		ЗаполнитьПоЗаказуНаПроизводствоСборка(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ДанныеЗаполненияВидОперации = Перечисления.ВидыОперацийЗаказНаПроизводство.Разборка Тогда
		ЗаполнитьПоЗаказуНаПроизводствоРазборка(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводствоСборка(ДанныеЗаполнения)
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка КАК ДокументОснование,
	|	ЗаказНаПроизводство.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПолучатель,
	|	ЗаказНаПроизводство.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение) КАК ВидОперации,
	|	ЗаказНаПроизводство.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводство.СтруктурнаяЕдиницаРезерв.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ ЗаказНаПроизводство.СтруктурнаяЕдиницаРезерв.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА ЗаказНаПроизводство.СтруктурнаяЕдиницаРезерв
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводство.СтруктурнаяЕдиница.ИсточникПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ ЗаказНаПроизводство.СтруктурнаяЕдиница.ИсточникПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА ЗаказНаПроизводство.СтруктурнаяЕдиница.ЯчейкаИсточникаПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|	КОНЕЦ КАК Ячейка,
	|	ЗаказНаПроизводство.Запасы.(
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Резерв КАК Резерв,
	|		Ссылка.ЗаказПокупателя КАК ЗаказПокупателя
	|	)
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	
	Запасы.Очистить();
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаИзРезультатаЗапроса);
		
		ВыборкаЗапасы = ВыборкаИзРезультатаЗапроса.Запасы.Выбрать();
		Пока ВыборкаЗапасы.Следующий() Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапасы);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводствоРазборка(ДанныеЗаполнения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка КАК ДокументОснование,
	|	ЗаказНаПроизводство.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПолучатель,
	|	ЗаказНаПроизводство.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение) КАК ВидОперации,
	|	ЗаказНаПроизводство.Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводство.СтруктурнаяЕдиницаРезерв.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ ЗаказНаПроизводство.СтруктурнаяЕдиницаРезерв.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА ЗаказНаПроизводство.СтруктурнаяЕдиницаРезерв
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводство.СтруктурнаяЕдиница.ИсточникПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ ЗаказНаПроизводство.СтруктурнаяЕдиница.ИсточникПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА ЗаказНаПроизводство.СтруктурнаяЕдиница.ЯчейкаИсточникаПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|	КОНЕЦ КАК Ячейка,
	|	ЗаказНаПроизводство.Продукция.(
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Резерв КАК Резерв,
	|		Ссылка.ЗаказПокупателя КАК ЗаказПокупателя
	|	)
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	
	Запасы.Очистить();
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаИзРезультатаЗапроса);
		
		ВыборкаПродукция = ВыборкаИзРезультатаЗапроса.Продукция.Выбрать();
		Пока ВыборкаПродукция.Следующий() Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПродукция);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоСборкеЗапасов(ДанныеЗаполнения) Экспорт
	
	ДанныеЗаполненияВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВидОперации");
	
	Если ДанныеЗаполненияВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка Тогда
		ЗаполнитьПоСборкеЗапасовСборка(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ДанныеЗаполненияВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Разборка Тогда
		ЗаполнитьПоСборкеЗапасовРазборка(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоСборкеЗапасовСборка(ДанныеЗаполнения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СборкаЗапасов.Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение) КАК ВидОперации,
	|	СборкаЗапасов.Организация КАК Организация,
	|	СборкаЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СборкаЗапасов.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	СборкаЗапасов.ЯчейкаПродукции КАК Ячейка,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ЯчейкаПолучателяПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|	КОНЕЦ КАК ЯчейкаПолучатель,
	|	СборкаЗапасов.Продукция.(
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Партия КАК Партия,
	|		Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА СборкаЗапасов.Продукция.Ссылка.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ СборкаЗапасов.Продукция.Количество
	|		КОНЕЦ КАК Резерв,
	|		СерийныеНомера,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.СборкаЗапасов КАК СборкаЗапасов
	|ГДЕ
	|	СборкаЗапасов.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	
	Запасы.Очистить();
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаИзРезультатаЗапроса);
		
		ВыборкаПродукция = ВыборкаИзРезультатаЗапроса.Продукция.Выбрать();
		Пока ВыборкаПродукция.Следующий() Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПродукция);
		КонецЦикла;
		
		РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения, "Продукция", "СерийныеНомераПродукция");
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоСборкеЗапасовРазборка(ДанныеЗаполнения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СборкаЗапасов.Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение) КАК ВидОперации,
	|	СборкаЗапасов.Организация КАК Организация,
	|	СборкаЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СборкаЗапасов.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	СборкаЗапасов.ЯчейкаПродукции КАК Ячейка,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ЯчейкаПолучателяПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|	КОНЕЦ КАК ЯчейкаПолучатель,
	|	СборкаЗапасов.Запасы.(
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Партия КАК Партия,
	|		Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА СборкаЗапасов.Запасы.Ссылка.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ СборкаЗапасов.Запасы.Количество
	|		КОНЕЦ КАК Резерв,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	|		СерийныеНомера,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.СборкаЗапасов КАК СборкаЗапасов
	|ГДЕ
	|	СборкаЗапасов.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	
	Запасы.Очистить();
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаИзРезультатаЗапроса);
		
		ВыборкаЗапасы = ВыборкаИзРезультатаЗапроса.Запасы.Выбрать();
		Пока ВыборкаЗапасы.Следующий() Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапасы);
		КонецЦикла;
		
		РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоПеремещениюПоЯчейкам(ДанныеЗаполнения) Экспорт
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ
	|	ПеремещениеПоЯчейкам.Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение) КАК ВидОперации,
	|	ПеремещениеПоЯчейкам.Организация КАК Организация,
	|	ПеремещениеПоЯчейкам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеПоЯчейкам.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ПеремещениеПоЯчейкам.СтруктурнаяЕдиница.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ ПеремещениеПоЯчейкам.СтруктурнаяЕдиница.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА ПеремещениеПоЯчейкам.СтруктурнаяЕдиница.ПолучательПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеПоЯчейкам.СтруктурнаяЕдиница.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ ПеремещениеПоЯчейкам.СтруктурнаяЕдиница.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА ПеремещениеПоЯчейкам.СтруктурнаяЕдиница.ЯчейкаПолучателяПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|	КОНЕЦ КАК ЯчейкаПолучатель,
	|	ПеремещениеПоЯчейкам.Запасы.(
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Партия КАК Партия,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		СерийныеНомера,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.ПеремещениеПоЯчейкам КАК ПеремещениеПоЯчейкам
	|ГДЕ
	|	ПеремещениеПоЯчейкам.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаИзРезультатаЗапроса);
		Запасы.Загрузить(ВыборкаИзРезультатаЗапроса.Запасы.Выгрузить());
		
	КонецЕсли;

	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДокументСсылкаЗаказ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Ссылка КАК ДокументОснование,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Ячейка КАК ЯчейкаПолучатель,
	|	ТаблицаДокумента.ОжидаетсяВыборВариантаКП
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧастьЗапасы.Ссылка КАК ЗаказПокупателя,
	|	ТабличнаяЧастьЗапасы.НомерСтроки,
	|	ТабличнаяЧастьЗапасы.Номенклатура,
	|	ТабличнаяЧастьЗапасы.Характеристика,
	|	ТабличнаяЧастьЗапасы.Партия,
	|	ТабличнаяЧастьЗапасы.ЕдиницаИзмерения,
	|	ТабличнаяЧастьЗапасы.Количество,
	|	ТабличнаяЧастьЗапасы.Резерв,
	|	ТабличнаяЧастьЗапасы.Содержание,
	|   ТабличнаяЧастьЗапасы.Сумма КАК СуммаЗаказа
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ТабличнаяЧастьЗапасы
	|ГДЕ
	|	ТабличнаяЧастьЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказ);
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказ, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Если ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Ссылка КАК ДокументОснование", "&Ссылка КАК ЗаказПокупателя");
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатыЗапроса[0].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапка = РезультатыЗапроса[0].Выбрать();
	ВыборкаШапка.Следующий();
	
	ЗначенияРеквизитов = Новый Структура("ОжидаетсяВыборВариантаКП", ВыборкаШапка.ОжидаетсяВыборВариантаКП);
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДокументСсылкаЗаказ, ЗначенияРеквизитов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	
	Запасы.Загрузить(РезультатыЗапроса[1].Выгрузить());
	
КонецПроцедуры

//Паганини_
Процедура ЗаполнитьПоВнутреннийЗаказ(ДанныеЗаполнения) Экспорт
	
	Если Не ДанныеЗаполнения.Проведен Тогда
		ТекстОшибки = НСтр("ka='დოკუმენტი %Документ% არ არის გატარებული. გაუტარებელი დოკუმენტის საფუძველზე შეყვანა აკრძალულია.';ru='Документ %Документ% не проведен. Ввод на основании непроведенного документа запрещен.';en='Document%% Document not conducted. Putting on the basis of failure to the document denied.'");
  		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДанныеЗаполнения.Ссылка);
  		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&Ссылка КАК ДокументОснование,
		|	ВнутреннийЗаказ.Организация КАК Организация,
		|	ВнутреннийЗаказ.СтруктурнаяЕдиницаОтправитель КАК СтруктурнаяЕдиница,
		|	ВнутреннийЗаказ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПолучатель,
		|	ВнутреннийЗаказ.Запасы.(
		|		Ссылка,
		|		НомерСтроки,
		|		Номенклатура,
		|		Характеристика,
		|		ЕдиницаИзмерения," +
			 ?(ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах,"		УтвержденноеКоличество КАК Количество,","		Количество КАК Количество,")		 
		 +	 
		"		УтвержденноеКоличество КАК КоличествоВДороге
		|	)
		|ИЗ
		|	Документ.ВнутреннийЗаказ КАК ВнутреннийЗаказ
		|ГДЕ
		|	ВнутреннийЗаказ.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ЧерезТранзитныйСклад = ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах;
	СтруктурнаяЕдиницаКонечныйПолучатель = ДанныеЗаполнения.СтруктурнаяЕдиница;
	
	Если ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда	
		Запасы.Загрузить(ПолучитьОстаткиВнутреногоЗаказа(ДанныеЗаполнения));
	Иначе	
		Запасы.Загрузить(Выборка.Запасы.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОстаткиВнутреногоЗаказа(ВнутреныйЗаказСслка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыНаПеремещениеОстатки.Номенклатура,
	               |	ЗаказыНаПеремещениеОстатки.Характеристика,
	               |	ЗаказыНаПеремещениеОстатки.Партия,
	               |	ЗаказыНаПеремещениеОстатки.КоличествоОстаток КАК Количество,
				   |	ЗаказыНаПеремещениеОстатки.КоличествоОстаток КАК КоличествоВДороге,
	               |	ЗаказыНаПеремещениеОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрНакопления.ЗаказыНаПеремещение.Остатки(, Заказ = &Заказ) КАК ЗаказыНаПеремещениеОстатки";
	
	Запрос.УстановитьПараметр("Заказ",ВнутреныйЗаказСслка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

// Kuzmich, 08.01.2020
Процедура ЗаполнитьПоПеремещениеЗапасов(ДанныеЗаполнения) Экспорт
	
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
	ЭтотОбъект.СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиницаПолучатель;
	ЭтотОбъект.СчетЗатрат = ДанныеЗаполнения.СчетЗатрат;
	ЭтотОбъект.ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
	ЭтотОбъект.КоличествоТоваров = ДанныеЗаполнения.КоличествоТоваров;
	
	Запасы.Загрузить(ДанныеЗаполнения.Запасы.Выгрузить());
	
	СерийныеНомера.Загрузить(ДанныеЗаполнения.СерийныеНомера.Выгрузить());
	
КонецПроцедуры
// Kuzmich, 08.01.2020

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоТоваров = Запасы.Итог("Количество"); //+++ Дмгг
	
КонецПроцедуры

Процедура СоздатьИлиИзменитьДокументПеремещения(Отказ)
	
	Если Отказ ИЛИ ЗначениеЗаполнено(ДокументПеремещенияВТранзит) Тогда
		Возврат;
	КонецЕсли;

	ПеремещенияИзТранзита = Документы.ПеремещениеЗапасов.НайтиПоРеквизиту("ДокументПеремещенияВТранзит", Ссылка);
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		Если ЗначениеЗаполнено(ПеремещенияИзТранзита) Тогда
			ПеремещенияИзТранзита = ПеремещенияИзТранзита.ПолучитьОбъект();
			Попытка
				ПеремещенияИзТранзита.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	Иначе
		Если ЧерезТранзитныйСклад Тогда
			Если ЗначениеЗаполнено(ПеремещенияИзТранзита) Тогда
				ПеремещенияИзТранзита = ПеремещенияИзТранзита.ПолучитьОбъект();
				Если Не ЗначениеЗаполнено(ДатаПеремещенияИзТранзита) Тогда
					Попытка
						ПеремещенияИзТранзита.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Исключение
						Сообщить(ОписаниеОшибки());
					КонецПопытки;
					Возврат;
				КонецЕсли;
			Иначе
				Если Не ЗначениеЗаполнено(ДатаПеремещенияИзТранзита) Тогда
					Возврат;
				КонецЕсли;
				ПеремещенияИзТранзита = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			КонецЕсли;
			

			ПеремещенияИзТранзита.Заполнить(Ссылка);
			РеквизитыШапки = Метаданные.Документы.ПеремещениеЗапасов.Реквизиты;
			Для Каждого РеквизитаДок Из РеквизитыШапки Цикл
				ИмяРеквизита = РеквизитаДок.Имя;
				Если НЕ ИмяРеквизита = "IDTТН" И
					 НЕ ИмяРеквизита = "НомерТТН" И
					 НЕ ИмяРеквизита = "Автор" ИЛИ
					 НЕ ИмяРеквизита = "ДокументОснование" Тогда
					ПеремещенияИзТранзита[ИмяРеквизита] = Ссылка[ИмяРеквизита];
				КонецЕсли;
			КонецЦикла;
			ПеремещенияИзТранзита.ЧерезТранзитныйСклад          = Ложь;
			ПеремещенияИзТранзита.Дата							= ДатаПеремещенияИзТранзита;
			ПеремещенияИзТранзита.ДатаПеремещенияИзТранзита     = Дата(1,1,1);
			ПеремещенияИзТранзита.ДокументПеремещенияВТранзит 	= Ссылка;
			ПеремещенияИзТранзита.СтруктурнаяЕдиница 			= ПеремещенияИзТранзита.СтруктурнаяЕдиницаПолучатель;
			ПеремещенияИзТранзита.СтруктурнаяЕдиницаПолучатель 	= ПеремещенияИзТранзита.СтруктурнаяЕдиницаКонечныйПолучатель;
			
			ПеремещенияИзТранзита.Запасы.Очистить();
			Для Каждого СтрокаТЧ Из Запасы Цикл
				Если СтрокаТЧ.Количество - СтрокаТЧ.КоличествоВДороге > 0 Тогда
					СтрЗапасы = ПеремещенияИзТранзита.Запасы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрЗапасы, СтрокаТЧ);
					СтрЗапасы.Количество 		= СтрокаТЧ.Количество - СтрокаТЧ.КоличествоВДороге;
					СтрЗапасы.Резерв			= ?(СтрокаТЧ.Резерв = 0, 0, Мин(СтрокаТЧ.Резерв, СтрЗапасы.Количество));
					СтрЗапасы.КоличествоВДороге = 0;
				КонецЕсли;
			КонецЦикла;
			Попытка
				ПеремещенияИзТранзита.Записать(мРежимЗаписи);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Если ЗначениеЗаполнено(ПеремещенияИзТранзита) Тогда
				ПеремещенияИзТранзита = ПеремещенияИзТранзита.ПолучитьОбъект();
				Попытка
					ПеремещенияИзТранзита.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата())); //+++ Дмгг
#КонецЕсли
